app/controllers/posts_controller.rb

	def create
	  @post = Post.new
	  @post.title = params[:title]
	  @post.description = params[:description]
	  @post.save
---
INSERT INTO "posts" ("title", "description", "created_at", "updated_at", "author_id") VALUES (?, ?, ?, ?, ?)  [["title", "My post title"], ["description", "My post description"], ["created_at", "2024-08-19 20:22:39.033083"], ["updated_at", "2024-08-19 20:22:39.033083"], ["author_id", 1]]